Re7e5/kepsilon/18g/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            noSlip;
    }

    front
    {
        type            empty;
    }
   back
    {
        type            empty;
    }
    bottom
    {
        type            fixedValue;
        value            uniform (1 0 0);
    }
    top
    {
        type            fixedValue;
        value            uniform (1 0 0);
    }
}

// ************************************************************************* //
